Merge pull request #4 from HIRO-MicroDataCenters-BV/POC
Replace ASCII diagrams with Mermaid
